app/views/tops/_boardbox.html.erb

SELECT `gametitles`.* FROM `gametitles` WHERE `gametitles`.`id` = 1 LIMIT 1
---
    </div>
    <% if (gametitle = Gametitle.find_by(id: board.boards_gametitle_id)) && gametitle.game_image.attached? %>