app/controllers/boards_controller.rb

SELECT `boards`.* FROM `boards`
---
  def index
    @boards = Board.all

SELECT `gametitles`.`gamename`, `gametitles`.`id` FROM `gametitles`
---
  def new
    @board = Board.new
    @gametitles = Gametitle.all.pluck(:gamename, :id)

SELECT `gametitles`.`gamename`, `gametitles`.`id` FROM `gametitles`
---
  def edit
    @gametitles = Gametitle.all.pluck(:gamename, :id)

UPDATE `boards` SET `boards`.`boards_gametitle_id` = 3, `boards`.`openchanger` = FALSE, `boards`.`playtime` = '2024-07-19 02:02:00', `boards`.`updated_at` = '2024-07-19 08:07:55.940977' WHERE `boards`.`id` = 1
SELECT `gametitles`.`gamename`, `gametitles`.`id` FROM `gametitles`
---
  def update
    if @board.update(board_params)
      redirect_to boards_path, notice: 'Board was successfully updated.'
    else
      @gametitles = Gametitle.all.pluck(:gamename, :id)

INSERT INTO `boards` (`user_id`, `boards_gametitle_id`, `playstyle`, `number_of_people`, `openchanger`, `boards_tag_id`, `playtime`, `freetext`, `created_at`, `updated_at`) VALUES (1, 3, 'ランク', 3, TRUE, 3, '2024-07-17 06:43:00', '', '2024-07-17 17:39:36.175245', '2024-07-17 17:39:36.175245')
---
  def create
    @board = Board.new(board_params)
    @board.user = current_user

    if @board.save

SELECT `boards`.* FROM `boards` WHERE `boards`.`id` = 1 LIMIT 1
---
  def set_board
    @board = Board.find(params[:id])

SELECT `gametitles`.`gamename`, `gametitles`.`id` FROM `gametitles`
---
  def set_gametitles
    @gametitles = Gametitle.pluck(:gamename, :id)