app/controllers/gametitles_controller.rb

SELECT `gametitles`.* FROM `gametitles`
---
  def index
    @gametitles = Gametitle.all

INSERT INTO `gametitles` (`gamename`, `game_image`, `created_at`, `updated_at`) VALUES ('オーバーウォッチ2', '#<ActionDispatch::Http::UploadedFile:0x00007f680c111018>', '2024-07-15 07:08:04.823060', '2024-07-15 07:08:04.823060')
---
  def create
    @gametitle = Gametitle.new(gametitle_params)
    if @gametitle.save