app/controllers/tops_controller.rb

  def index
    @boards = Board.includes(user: { icon_image_attachment: :blob })
---
SELECT `boards`.* FROM `boards`