app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `gender`, `age`, `icon_image`, `created_at`, `updated_at`) VALUES ('333', 'Male', 1, '', '2024-05-27 10:54:03.720051', '2024-05-27 10:54:03.720051')

  def update
    if @user.update(user_params)
---
UPDATE `users` SET `users`.`gender` = 'Male', `users`.`updated_at` = '2024-07-15 07:40:50.485439' WHERE `users`.`id` = 2

  def icon
    user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1